In [1]:
import pandas as pd

### 数据透视与逆透视

透视（pivot）和逆透视（melt）是一对互逆的数据重塑操作：

* **透视**操作将原始数据从长格式（多行、多列）转换为宽格式（单行、多列）；
* **逆透**视操作则将宽格式成数据转换长格式

In [6]:
df1 = pd.DataFrame({
    '姓名': ['张三', '张三', '张三', '李四', '李四', ],
    '课程': ['高数', '线代', '英语', '高数', '线代', ],
    '成绩': [91, 92, 90, 75, 76, ]
})

df1

   姓名  课程  成绩
0  张三  高数  91
1  张三  线代  92
2  张三  英语  90
3  李四  高数  75
4  李四  线代  76

In [3]:
df2 = df1.pivot(index='姓名', columns='课程', values='成绩')
df2

课程    线代    英语    高数
姓名
张三  92.0  90.0  91.0
李四  76.0   NaN  75.0

In [12]:
df2.reset_index()

课程  姓名    线代    英语    高数
0   张三  92.0  90.0  91.0
1   李四  76.0   NaN  75.0

In [11]:
df2.reset_index().melt(id_vars='姓名', var_name='课程', value_name='成绩')

   姓名  课程    成绩
0  张三  线代  92.0
1  李四  线代  76.0
2  张三  英语  90.0
3  李四  英语   NaN
4  张三  高数  91.0
5  李四  高数  75.0

In [7]:
df2.reset_index()melt(id_vars='姓名', var_name='课程', value_name="成绩")

课程  姓名    线代    英语    高数
0   张三  92.0  90.0  91.0
1   李四  76.0   NaN  75.0